#### ExternalDBApplicationResult Enumeration

---

|  |
| --- |
| See Also |

Informs Autodesk Revit of the status of your external db application after execution.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ExternalDBApplicationResult ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ExternalDBApplicationResult ``` |

| Visual C++ |
| --- |
| ``` public enum class ExternalDBApplicationResult ``` |

# Members

| Member name | Description |
| --- | --- |
| Failed | The external db application was unable to complete its task. |
| Succeeded | The external db application completed successfully. Autodesk Revit will keep this object during the entire Revit session. |

# See Also

Autodesk.Revit.DB Namespace